# ============================================================
# Rule Name : Brute Force - Multiple Failed Logons
# Author    : TripleS
# MITRE     : T1110.001 - Brute Force: Password Guessing
# Log Source: WinEventLog:Security (EventCode 4625)
# Tactic    : Credential Access
# ============================================================
# @name     = SOC - Brute Force - Multiple Failed Logons
# @cron     = */5 * * * *
# @earliest = -10m@m
# @latest   = now
# @severity = 4
# @app      = search
# === SPL ===
index=wineventlog sourcetype="WinEventLog:Security" EventCode=4625
| bucket _time span=10m
| stats count AS failed_count
        values(src_ip) AS src_ip
        dc(Account_Name) AS distinct_accounts
        values(Account_Name) AS targeted_accounts
        BY _time, ComputerName
| where failed_count >= 15
| eval mitre="T1110.001", severity="high"
| table _time, ComputerName, src_ip, targeted_accounts, distinct_accounts, failed_count, mitre, severity
| sort - failed_count
