# ============================================================
# Rule Name : Credential Dumping via LSASS Access (Mimikatz)
# Author    : TripleS
# MITRE     : T1003.001 - OS Credential Dumping: LSASS Memory
# Log Source: Sysmon EventCode 10 (ProcessAccess)
# Tactic    : Credential Access
# ============================================================
# @name     = SOC - LSASS Credential Dumping
# @cron     = */5 * * * *
# @earliest = -10m@m
# @latest   = now
# @severity = 5
# @app      = search
# === SPL ===
index=* host="triples-api" sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=10
TargetImage="*\\lsass.exe"
| eval ga=upper(GrantedAccess)
| where like(ga,"0X1010") OR like(ga,"0X1410") OR like(ga,"0X1438") OR like(ga,"0X143A") OR like(ga,"0X1FFFFF")
| search NOT SourceImage IN ("*\\wininit.exe","*\\csrss.exe","*\\services.exe","*\\MsMpEng.exe")
| stats count values(SourceImage) AS source_process values(GrantedAccess) AS granted_access
        BY _time, Computer, User
| eval mitre="T1003.001", severity="critical"
| table _time, Computer, User, source_process, granted_access, count, mitre, severity
