# ============================================================
# Rule Name : Suspicious Scheduled Task Creation
# Author    : TripleS
# MITRE     : T1053.005 - Scheduled Task/Job: Scheduled Task
# Log Source: WinEventLog:Security (EventCode 4698)
# Tactic    : Persistence / Execution
# ============================================================
# @name     = SOC - Suspicious Scheduled Task Creation
# @cron     = */10 * * * *
# @earliest = -15m@m
# @latest   = now
# @severity = 4
# @app      = search
# === SPL ===
index=* host="triples-api" sourcetype="WinEventLog:Security" EventCode=4698
| eval cmd=lower(Task_Content)
| where match(cmd,"powershell|cmd\.exe|-enc|frombase64|\\\\temp\\\\|\\\\appdata\\\\|mshta|rundll32|regsvr32|certutil|\\.bat|\\.vbs|\\.ps1")
| stats count values(Task_Name) AS task_name values(Task_Content) AS task_action
        BY _time, ComputerName, Account_Name
| eval mitre="T1053.005", severity="high"
| table _time, ComputerName, Account_Name, task_name, task_action, mitre, severity
