# ============================================================
# Rule Name : User Added to Privileged Group
# Author    : TripleS
# MITRE     : T1098 / T1078.002 - Account Manipulation / Privilege Escalation
# Log Source: WinEventLog:Security (4728, 4732, 4756)
# Tactic    : Privilege Escalation / Persistence
# ============================================================
# @name     = SOC - User Added to Privileged Group
# @cron     = */10 * * * *
# @earliest = -15m@m
# @latest   = now
# @severity = 4
# @app      = search
# === SPL ===
index=* host="triples-api" sourcetype="WinEventLog:Security" EventCode IN (4728,4732,4756)
| eval grp=lower(Group_Name)
| where match(grp,"domain admins|enterprise admins|administrators|schema admins|backup operators|account operators|server operators|remote desktop users|dnsadmins")
| stats values(Group_Name) AS group_name values(Member_Name) AS added_member
        values(Account_Name) AS performed_by BY _time, ComputerName, EventCode
| eval mitre="T1098", severity="high"
| table _time, ComputerName, group_name, added_member, performed_by, mitre, severity
